
Недавно мы считали для каждого слова количество его вхождений в строку. Но на все слова может быть не так интересно смотреть, как,
например, на наиболее часто используемые.

Напишите программу, которая считывает текст из файла (в файле может быть больше одной строки) и выводит самое частое слово в этом
тексте и через пробел то, сколько раз оно встретилось. Если таких слов несколько, вывести лексикографически первое (можно использовать
оператор < для строк).

В качестве ответа укажите вывод программы, а не саму программу.
Слова, написанные в разных регистрах, считаются одинаковыми.

Sample Input:
abc a bCd bC AbC BC BCD bcd ABC
Sample Output:
abc 3

-------------
with open('text.txt', 'r') as inf:
    x = inf.read().lower().split()
d = {}
for i in range(len(x)):
    d[x[i]] = 1
max_cnt = 1
for i, j in d.items():
    cnt = 0
    for k in range(len(x)):
        if i == x[k]:
            cnt +=1
    if cnt >= max_cnt:
        max_cnt = cnt
    d[i] = cnt

x.sort()
prnt_max = x[len(x) - 1]
for i, j in d.items():
    if j == max_cnt and i < prnt_max:
        prnt_max = i
print(prnt_max, max_cnt)
